---
kind: method
id: M:Autodesk.Revit.DB.DataConversionMonitorScope.Dispose
source: html/b6844000-a797-5f76-85c6-bef5e773e292.htm
---
# Autodesk.Revit.DB.DataConversionMonitorScope.Dispose Method

Releases all resources used by the DataConversionMonitorScope

## Syntax (C#)
```csharp
public void Dispose()
```